Repository: ryujou/Maurya-Source
Catalog: ios/App/Resources/Localizable.xcstrings
Source language: en
Languages: ja, zh_hans

# help.script.body
source: Use effect "Name" { ... } and end statements with semicolons. Targets are all or group(1)…group(7); use color, hsv, mode, wait, and fade. Variables, conditions, loops, and functions are supported. Code is parsed as a restricted effect language—it cannot execute JavaScript or system commands. Syntax, zero-time loops, and invisible states are checked before playback.
ja: effect "名前" { ... } を入口にし、文末にセミコロンを付けます。対象は all または group(1)…group(7)で、color、hsv、mode、wait、fade、変数、判定、ループ、関数を使えます。制限付き灯光言語のため JavaScript やシステム命令は実行せず、再生前に構文、時間の進まないループ、不可視状態を検査します。
zh_hans: 使用 effect "名称" { ... } 作为入口，语句以分号结尾。目标为 all 或 group(1)…group(7)，支持 color、hsv、mode、wait 和 fade，也支持变量、判断、循环与函数。代码是受限灯效语言，不执行 JavaScript 或系统命令；播放前会检查语法、零耗时循环和不可见状态。

# help.script.example
source: effect "Red Blue Strobe" { forever { all.mode(STROBE, 128); all.color("#FF2D55"); wait(2s); all.color("#1677FF"); wait(2s); } }
ja: effect "赤青点滅" { forever { all.mode(STROBE, 128); all.color("#FF2D55"); wait(2s); all.color("#1677FF"); wait(2s); } }
zh_hans: effect "红蓝频闪" { forever { all.mode(STROBE, 128); all.color("#FF2D55"); wait(2s); all.color("#1677FF"); wait(2s); } }

# help.script.example.accessibility
source: Example Maurya Script alternating red and blue every two seconds.
ja: 2秒ごとに赤と青を切り替える Maurya Script の例。
zh_hans: 每两秒切换红色和蓝色的 Maurya Script 示例。

# help.script.example.title
source: Script Example
ja: スクリプト例
zh_hans: 脚本示例

# help.script.title
source: Maurya Script Syntax
ja: Maurya Script 文法
zh_hans: Maurya Script 语法

# help.sensors.body
source: Programs can use motion, orientation, proximity, heading, pressure, audio level, bands, beat, and BPM. Missing required hardware prevents playback. Microphone input is analyzed at 16 kHz and is never saved or uploaded. Inputs are active only during temporary RAM playback and are released on stop.
ja: モーション、姿勢、近接、方位、気圧、音量、帯域、ビート、BPM を参照できます。必要なハードウェアがない場合は再生しません。マイクは 16 kHz で解析するだけで保存・送信せず、RAM 一時再生中のみ有効で停止時に解除します。
zh_hans: 程序可读取运动、姿态、接近、方向、气压、音量、频段、节拍和 BPM。缺少必需硬件时不会播放。麦克风仅以 16 kHz 分析，不保存或上传录音；输入仅在 RAM 临时播放期间启用，停止后立即释放。

# help.sensors.title
source: Device Sensors and Music
ja: 端末センサーと音楽解析
zh_hans: 手机传感器与音乐

# integration.ble.pending
source: BLE discovery is unavailable in this offline review fixture.
ja: このオフライン審査用環境では BLE 検索を利用できません。
zh_hans: 离线审核环境中无法使用 BLE 发现功能。

# integration.device.not-ready
source: The device connection is not ready.
ja: デバイス接続の準備ができていません。
zh_hans: 设备连接尚未就绪。

# integration.device.pending
source: Device control is unavailable in this offline review fixture.
ja: このオフライン審査用環境ではデバイス操作を利用できません。
zh_hans: 离线审核环境中无法使用设备控制功能。

# integration.share.pending
source: Share networking and import are unavailable in this offline review fixture.
ja: このオフライン審査用環境では共有通信と読み込みを利用できません。
zh_hans: 离线审核环境中无法使用分享网络与导入功能。

# language.system
source: System Default
ja: システム設定
zh_hans: 跟随系统

# language.title
source: Language
ja: 言語
zh_hans: 语言

# legal.data.audio
source: Audio is analyzed only during an audio-reactive session.
ja: 音声連動セッションの実行中だけ音声を解析します。
zh_hans: 仅在运行音频响应会话时分析声音。

# legal.data.motion
source: Motion is read only during a motion-reactive session.
ja: モーション連動セッションの実行中だけモーションを読み取ります。
zh_hans: 仅在运行运动响应会话时读取运动数据。

# legal.data.share
source: Temporary sharing sends the selected effect or palette only after you choose Generate.
ja: 一時共有は「生成」を選んだ後に、選択したエフェクトまたはパレットだけを送信します。
zh_hans: 只有在你选择“生成”后，临时分享才会发送所选效果或色板。

# legal.data.title
source: Data Use
ja: データ利用
zh_hans: 数据使用

# legal.materials.review
source: Bundled character, group, image, name, and trademark rights still require item-by-item approval before release. Inclusion in this review build is not a license claim.
ja: 同梱するキャラクター、グループ、画像、名称、商標は、リリース前に項目ごとの承認が必要です。レビュー用ビルドへの収録はライセンス取得の主張ではありません。
zh_hans: 内置角色、组合、图片、名称和商标仍需在发布前逐项取得批准。出现在审核构建中不代表已主张获得许可。

# legal.materials.title
source: Character & Brand Materials
ja: キャラクターとブランド素材
zh_hans: 角色与品牌素材

# legal.ota.gate
source: Updates remain unavailable until a trusted production endpoint, signing key, compatible connected device, and verified manifest are present.
ja: 信頼済み本番エンドポイント、署名鍵、互換性のある接続デバイス、検証済みマニフェストが揃うまで更新は利用できません。
zh_hans: 只有可信生产端点、签名密钥、兼容的已连接设备和已验证清单全部就绪后，更新才可使用。

# legal.ota.risk
source: Do not power off the Maurya device during firmware installation. An interrupted update can require hardware recovery.
ja: ファームウェアのインストール中は Maurya デバイスの電源を切らないでください。中断するとハードウェア復旧が必要になる場合があります。
zh_hans: 固件安装期间请勿关闭 Maurya 设备电源。更新中断可能需要硬件恢复。

# legal.ota.title
source: Firmware Update Risk
ja: ファームウェア更新のリスク
zh_hans: 固件更新风险

# legal.privacy.external.gate
source: A production privacy-policy URL and final network disclosure are release gates and are not configured in this build.
ja: 本番プライバシーポリシー URL と最終的な通信データ説明はリリース条件であり、このビルドには設定されていません。
zh_hans: 生产隐私政策网址和最终网络数据说明仍是发布门槛，本构建未配置这些内容。

# legal.privacy.local
source: Maurya processes Bluetooth device state, motion, and live audio on this device. Raw microphone audio is not saved or uploaded.
ja: Maurya は Bluetooth デバイス状態、モーション、リアルタイム音声を端末内で処理します。マイクの生音声を保存または送信しません。
zh_hans: Maurya 在本机处理蓝牙设备状态、运动数据和实时声音。原始麦克风音频不会被保存或上传。

# legal.privacy.title
source: Privacy
ja: プライバシー
zh_hans: 隐私

# legal.third.party.title
source: Third-Party Notices
ja: 第三者ソフトウェア通知
zh_hans: 第三方声明

# legal.third.party.unavailable
source: Third-party notices are unavailable in this build.
ja: このビルドでは第三者ソフトウェア通知を読み込めません。
zh_hans: 此构建中无法读取第三方声明。

# legal.title
source: Privacy & Legal
ja: プライバシーと法的情報
zh_hans: 隐私与法律信息

# ota.cancel
source: Cancel update
ja: 更新をキャンセル
zh_hans: 取消升级

# ota.current.stage
source: Current stage
ja: 現在の段階
zh_hans: 当前阶段

# ota.gate.message
source: No stage reports success until the device returns with the target version. Physical-device recovery, signing, and copyright approval remain release gates.
ja: 対象版でデバイスが再接続されるまで成功を表示しません。実機復旧、署名、著作権承認はリリース Gate です。
zh_hans: 设备以目标版本重新上线前，任何阶段都不会报告成功。真机恢复、签名和版权批准仍是发布 Gate。

# ota.gates
source: Release gates
ja: リリース Gate
zh_hans: 发布 Gate

# ota.installed.version
source: Installed version
ja: 導入済みバージョン
zh_hans: 已安装版本

# ota.preflight
source: Security preflight
ja: セキュリティ事前確認
zh_hans: 安全预检

# ota.preflight.checking
source: Checking configuration
ja: 設定を確認中
zh_hans: 正在检查配置

# ota.preflight.device-required
source: A compatible connected device is still required
ja: 対応する接続済みデバイスが必要です
zh_hans: 仍需连接兼容设备

# ota.preflight.network
source: Unavailable: no approved OTA HTTPS endpoint is configured.
ja: 利用不可：承認済み OTA HTTPS エンドポイントが未設定です。
zh_hans: 不可用：未配置已批准的 OTA HTTPS 端点。

# ota.preflight.production-key
source: Unavailable: no production manifest verification key is configured.
ja: 利用不可：本番 manifest 検証公開鍵が未設定です。
zh_hans: 不可用：未配置生产 manifest 验签公钥。

# ota.preflight.ready
source: Network endpoint and production key are configured
ja: ネットワーク先と本番キーを設定済み
zh_hans: 网络端点和生产密钥已配置

# ota.refresh
source: Refresh preflight
ja: 事前確認を更新
zh_hans: 刷新预检

# ota.runtime.cancelled
source: Cancelled
ja: キャンセル済み
zh_hans: 已取消

# ota.runtime.committing
source: Committing verified firmware
ja: 検証済みファームウェアを確定中
zh_hans: 正在提交已验证固件

# ota.runtime.confirmingVersion
source: Confirming installed version
ja: 導入版を確認中
zh_hans: 正在确认安装版本

# ota.runtime.downloading
source: Downloading firmware
ja: ファームウェアをダウンロード中
zh_hans: 正在下载固件

# ota.runtime.failed
source: Failed
ja: 失敗
zh_hans: 失败

# ota.runtime.fetchingManifest
source: Fetching signed manifest
ja: 署名済み manifest を取得中
zh_hans: 正在获取签名 manifest

# ota.runtime.gettingInfo
source: Reading device information
ja: デバイス情報を取得中
zh_hans: 正在读取设备信息

# ota.runtime.idle
source: Idle
ja: 待機中
zh_hans: 空闲

# ota.runtime.preparing
source: Preparing resumable BLE transfer
ja: 再開可能な BLE 転送を準備中
zh_hans: 正在准备可恢复 BLE 传输

# ota.runtime.reconnecting
source: Waiting for device to return
ja: デバイスの復帰を待機中
zh_hans: 正在等待设备重新上线

# ota.runtime.succeeded
source: Update completed and version confirmed
ja: 更新完了・バージョン確認済み
zh_hans: 升级完成且版本已确认

# ota.runtime.transferring
source: Transferring acknowledged chunks
ja: 確認応答付きチャンクを転送中
zh_hans: 正在传输并确认数据块

# ota.runtime.upToDate
source: Already up to date
ja: 最新です
zh_hans: 已经是最新版本

# ota.runtime.validatingArtifact
source: Verifying firmware size and SHA-256
ja: サイズと SHA-256 を検証中
zh_hans: 正在验证固件大小与 SHA-256

# ota.runtime.validatingManifest
source: Verifying manifest signature and policy
ja: manifest の署名とポリシーを検証中
zh_hans: 正在验证 manifest 签名与策略

# ota.runtime.verifying
source: Device is verifying firmware
ja: デバイスがファームウェアを検証中
zh_hans: 设备正在验证固件

# ota.stage.device
source: Check device capability, layout, and secure version
ja: デバイス能力、レイアウト、安全版を確認
zh_hans: 检查设备能力、布局与安全版本

# ota.stage.manifest
source: Fetch manifest
ja: manifest を取得
zh_hans: 获取 manifest

# ota.stage.reboot
source: Reconnect and confirm installed version
ja: 再接続して導入版を確認
zh_hans: 重连并确认安装版本

# ota.stage.signature
source: Verify detached signature and hash
ja: 分離署名と hash を検証
zh_hans: 验证分离签名与 hash

# ota.stage.transfer
source: Transfer and confirm offsets
ja: 転送して offset を確認
zh_hans: 传输并确认 offset

# ota.start
source: Start secure update
ja: 安全な更新を開始
zh_hans: 开始安全更新

# ota.start.device-disabled
source: Transfer remains disabled until a compatible Maurya device is connected and revalidated.
ja: 対応する Maurya デバイスを接続して再検証するまで転送は無効です。
zh_hans: 连接并重新校验兼容的 Maurya 设备前，固件传输保持禁用。

# ota.target.version
source: Target version
ja: 対象バージョン
zh_hans: 目标版本

# ota.transfer.progress
source: Transfer progress
ja: 転送進捗
zh_hans: 传输进度

# ota.workflow
source: Workflow
ja: ワークフロー
zh_hans: 工作流

# palette.all.groups
source: All 7 groups
ja: 全7グループ
zh_hans: 全部 7 组

# palette.apply
source: Apply to device group
ja: デバイスグループに適用
zh_hans: 应用到设备灯组

# palette.group %lld
source: Group %lld
ja: グループ %lld
zh_hans: 灯组 %lld

# palette.preview
source: Selected support color
ja: 選択中の応援カラー
zh_hans: 已选应援色

# palette.select.hint
source: Selects this support color for preview. It is not sent until you choose Apply.
ja: この応援カラーをプレビュー選択します。適用するまでデバイスへ送信しません。
zh_hans: 选择此应援色进行预览；只有点击应用后才会发送到设备。

# palette.target.group
source: Target lighting group
ja: 対象ライトグループ
zh_hans: 目标灯组

# playback.background.gate
source: Background continuation is disabled pending device and App Review approval
ja: 実機・App Review 承認までバックグラウンド継続は無効
zh_hans: 后台继续播放在真机与 App Review 批准前保持禁用

# playback.controls
source: Controls
ja: 操作
zh_hans: 控制

# playback.device.gate
source: Connect a compatible device and choose a compiled effect
ja: 対応デバイスを接続し、コンパイル済みエフェクトを選択
zh_hans: 连接兼容设备并选择已编译效果

# playback.disconnected
source: The device disconnected; streaming was stopped.
ja: デバイスが切断され、ストリーミングを停止しました。
zh_hans: 设备已断开，串流已停止。

# playback.foreground
source: Foreground playback
ja: フォアグラウンド再生
zh_hans: 前台播放

# playback.foreground.message
source: Playback is foreground-only and must pause during lifecycle interruptions.
ja: 再生はフォアグラウンド専用で、ライフサイクル中断時に一時停止します。
zh_hans: 播放仅支持前台运行，并会在生命周期中断时暂停。

# playback.gate
source: Required gates
ja: 必要な Gate
zh_hans: 必要 Gate

# playback.pause
source: Pause
ja: 一時停止
zh_hans: 暂停

# playback.resume
source: Resume
ja: 再開
zh_hans: 继续

# playback.start
source: Start
ja: 開始
zh_hans: 开始

# playback.state
source: Session
ja: セッション
zh_hans: 会话

# playback.state.idle
source: Idle
ja: 待機中
zh_hans: 空闲

# playback.state.paused
source: Paused
ja: 一時停止中
zh_hans: 已暂停

# playback.state.preparing
source: Preparing
ja: 準備中
zh_hans: 正在准备

# playback.state.running
source: Running
ja: 実行中
zh_hans: 正在运行

# playback.state.stopping
source: Stopping
ja: 停止中
zh_hans: 正在停止

# playback.stop
source: Stop
ja: 停止
zh_hans: 停止

# playback.unavailable.connection-and-effect
source: Playback is unavailable until a connected device and compiled effect are supplied.
ja: 接続済みデバイスとコンパイル済みエフェクトが揃うまで再生できません。
zh_hans: 连接设备并提供已编译效果前，播放不可用。

# resources.builtin
source: Built-in catalog
ja: 内蔵カタログ
zh_hans: 内置目录

# resources.custom
source: Custom palettes
ja: カスタムパレット
zh_hans: 自定义调色板

# resources.custom.add
source: Add palette
ja: 応援色を追加
zh_hans: 添加应援色

# resources.custom.avatar
source: Avatar
ja: アバター
zh_hans: 头像

# resources.custom.color
source: Support color
ja: 応援色
zh_hans: 应援色

# resources.custom.color.extract
source: Extract colors
ja: 色を抽出
zh_hans: 提取颜色

# resources.custom.count
source: Saved
ja: 保存済み
zh_hans: 已保存

# resources.custom.delete.message
source: The palette and its local avatar will be removed. You can undo this deletion during the current session.
ja: パレットと端末内のアバターを削除します。現在のセッション中は削除を取り消せます。
zh_hans: 此色板及其本地头像将被移除。你可以在当前会话中撤销删除。

# resources.custom.delete.title
source: Delete Palette?
ja: パレットを削除しますか？
zh_hans: 删除色板？

# resources.custom.edit
source: Edit palette
ja: 応援色を編集
zh_hans: 编辑应援色

# resources.custom.encoder.message
source: A physical-device WebP encoder and Android round-trip must pass before Photos import can save avatars.
ja: 実機 WebP エンコーダと Android 往復互換性の確認後に写真から保存できます。
zh_hans: 需先通过真机 WebP 编码器与 Android 往返互操作测试，才可从照片保存头像。

# resources.custom.encoder.title
source: Custom avatar import is gated
ja: カスタムアバター取込は未開放です
zh_hans: 自定义头像导入尚未开放

# resources.custom.export
source: Export palettes
ja: 応援色を書き出す
zh_hans: 导出应援色

# resources.custom.file.error.title
source: Palette File Error
ja: パレットファイルエラー
zh_hans: 色板文件错误

# resources.custom.import
source: Import palettes
ja: 応援色を読み込む
zh_hans: 导入应援色

# resources.custom.import.overwrite
source: Replace matching palettes
ja: 同じ項目を置き換える
zh_hans: 替换相同项目

# resources.custom.import.policy
source: How should matching palette IDs be handled?
ja: 同じ応援色 ID はどう処理しますか？
zh_hans: 遇到相同应援色 ID 时如何处理？

# resources.custom.import.skip
source: Keep existing palettes
ja: 既存項目を保持する
zh_hans: 保留现有项目

# resources.custom.name.ja
source: Japanese name
ja: 日本語名
zh_hans: 日文名称

# resources.custom.name.zh
source: Chinese name
ja: 中国語名
zh_hans: 中文名称

# resources.custom.names
source: Names
ja: 名前
zh_hans: 名称

# resources.custom.photo.choose
source: Choose photo
ja: 写真を選択
zh_hans: 选择照片

# resources.custom.photo.chosen
source: Choose another photo
ja: 別の写真を選択
zh_hans: 重新选择照片

# resources.custom.photo.contract
source: The center square is resized to 96 × 96 and encoded locally as a WebP no larger than 6 KiB.
ja: 写真中央の正方形を端末内で 96 × 96 に縮小し、6 KiB 以下の WebP に変換します。
zh_hans: 照片中央正方形会在本机缩放为 96 × 96，并编码成不超过 6 KiB 的 WebP。

# resources.custom.photo.error.message
source: Choose another image and try again.
ja: 別の画像を選んで再試行してください。
zh_hans: 请选择其他图片后重试。

# resources.custom.photo.error.title
source: Photo unavailable
ja: 写真を利用できません
zh_hans: 无法读取照片

# resources.custom.photo.keep
source: The current avatar is kept unless you choose another photo.
ja: 別の写真を選ばない場合は現在のアバターを保持します。
zh_hans: 不重新选图时会保留现有头像。

# resources.custom.photo.reset
source: Reset crop
ja: 切り抜きをリセット
zh_hans: 重置裁切

# resources.custom.photo.rotate
source: Rotate
ja: 回転
zh_hans: 旋转

# resources.custom.save.error.message
source: Your edits are still here. Review the palette details and try again.
ja: 編集内容はこの画面に残っています。内容を確認してもう一度お試しください。
zh_hans: 你的编辑仍保留在此页面。请检查色板内容后重试。

# resources.custom.save.error.title
source: Couldn’t Save Palette
ja: パレットを保存できません
zh_hans: 无法保存色板

# resources.legal.review
source: Legal review required
ja: 法務確認が必要
zh_hans: 需要法律审核

# review.analysis
source: Inspect permission context; audio and motion start only by user action
ja: 権限説明を確認。音声とモーションは利用者操作時のみ開始
zh_hans: 查看权限说明；音频和运动仅由用户主动启动

# review.ble
source: Bluetooth discovery, connection, and light controls
ja: Bluetooth 検出、接続、ライト制御
zh_hans: 蓝牙发现、连接与灯光控制

# review.editor
source: Open the verified offline effect editor
ja: 検証済みオフラインエフェクトエディタを開く
zh_hans: 打开已校验的离线效果编辑器

# review.guide.title
source: Review without hardware
ja: ハードウェアなしの審査ガイド
zh_hans: 无硬件审核指引

# review.hardware.required
source: Requires physical hardware
ja: 実機ハードウェアが必要
zh_hans: 需要实体硬件

# review.open
source: Open review guide
ja: 審査ガイドを開く
zh_hans: 打开审核指引

# review.ota
source: Signed firmware transfer, reboot, and installed-version confirmation
ja: 署名済みファームウェア転送、再起動、導入版確認
zh_hans: 签名固件传输、重启与安装版本确认

# review.playback
source: Acknowledged real-time effect playback
ja: 応答確認付きリアルタイムエフェクト再生
zh_hans: 带确认的实时效果播放

# review.resources
source: Browse the bundled resource inventory and legal status
ja: 内蔵リソース一覧と法的状態を確認
zh_hans: 浏览内置资源清单与法律状态

# review.share
source: Validate a share token locally; network import stays unavailable
ja: 共有トークンをローカル検証。ネットワーク取込は無効
zh_hans: 本地校验分享口令；网络导入保持不可用

# review.truthful.message
source: The app never substitutes demo success for unavailable Bluetooth, OTA, or share services. Disabled controls explain the missing prerequisite.
ja: 利用できない Bluetooth、OTA、共有サービスをデモ成功で代替しません。無効な操作には不足条件を表示します。
zh_hans: 应用不会用演示成功替代不可用的蓝牙、OTA 或分享服务。禁用控件会说明缺失的前置条件。

# review.truthful.states
source: Truthful status
ja: 正確な状態表示
zh_hans: 真实状态

# review.without.hardware
source: Available without a Maurya device
ja: Maurya デバイスなしで確認可能
zh_hans: 无需 Maurya 设备即可审核

# runtime.constraint.low-power
source: Realtime analysis and playback are paused while Low Power Mode is on.
ja: 低電力モード中はリアルタイム解析と再生を一時停止します。
zh_hans: 低电量模式开启期间，实时分析和播放已暂停。

# runtime.constraint.normal
source: Realtime features are available.
ja: リアルタイム機能を利用できます。
zh_hans: 实时功能可用。

# runtime.constraint.thermal
source: Realtime analysis and playback are paused until the device cools down.
ja: 端末の温度が下がるまでリアルタイム解析と再生を一時停止します。
zh_hans: 设备降温前，实时分析和播放已暂停。

# scan.connect.hint
source: Connects to this device and opens its controls.
ja: このデバイスに接続してコントロールを開きます。
zh_hans: 连接此设备并打开控制台。

# scan.lifecycle
source: Bluetooth status
ja: Bluetooth の状態
zh_hans: 蓝牙状态

# scan.nearby
source: Nearby Maurya devices
ja: 近くの Maurya デバイス
zh_hans: 附近的 Maurya 设备

# scan.refresh
source: Scan
ja: スキャン
zh_hans: 扫描

# scan.searching
source: Scanning…
ja: スキャン中…
zh_hans: 正在扫描…

# scan.shell.device
source: Open device shell
ja: デバイス画面を開く
zh_hans: 打开设备骨架

# scan.shell.message
source: Open the device shell to review the planned information architecture. No device operation is performed.
ja: 予定している情報構成を確認するための画面です。デバイス操作は行いません。
zh_hans: 此入口仅用于检查规划中的信息架构，不会执行任何设备操作。

# scan.shell.title
source: Phase 1 navigation shell
ja: Phase 1 ナビゲーションシェル
zh_hans: Phase 1 导航骨架

# scan.status.bluetooth.poweredOff
source: Bluetooth is off
ja: Bluetooth がオフです
zh_hans: 蓝牙已关闭

# scan.status.bluetooth.resetting
source: Bluetooth is resetting
ja: Bluetooth をリセット中です
zh_hans: 蓝牙正在重置

# scan.status.bluetooth.unauthorized
source: Bluetooth permission is required
ja: Bluetooth の許可が必要です
zh_hans: 需要蓝牙权限

# scan.status.bluetooth.unknown
source: Waiting for Bluetooth
ja: Bluetooth を待っています
zh_hans: 正在等待蓝牙

# scan.status.bluetooth.unsupported
source: Bluetooth is unsupported
ja: Bluetooth はサポートされていません
zh_hans: 此设备不支持蓝牙

# scan.status.connecting
source: Connecting and discovering services
ja: 接続してサービスを確認中
zh_hans: 正在连接并发现服务

# scan.status.failed
source: Connection failed
ja: 接続に失敗しました
zh_hans: 连接失败

# scan.status.idle
source: Idle
ja: 待機中
zh_hans: 空闲

# scan.status.ready
source: Ready
ja: 準備完了
zh_hans: 已就绪

# scan.status.scanning
source: Scanning
ja: スキャン中
zh_hans: 正在扫描

# scan.stop
source: Stop
ja: 停止
zh_hans: 停止

# scan.title
source: Devices
ja: デバイス
zh_hans: 设备

# scan.unavailable.title
source: Device discovery is not connected
ja: デバイス検索は未接続です
zh_hans: 设备发现尚未接入

# share.busy
source: Verifying securely
ja: 安全に検証中
zh_hans: 正在安全校验

# share.create.empty.effects
source: There are no effects to share.
ja: 共有できるエフェクトがありません。
zh_hans: 暂无可分享灯效。

# share.create.empty.palettes
source: There are no custom palettes to share.
ja: 共有できるカスタム応援色がありません。
zh_hans: 暂无可分享的自定义应援色。

# share.create.idle
source: Choose one item. Nothing is uploaded until you tap Generate QR.
ja: 項目を選択してください。QR生成を押すまでアップロードしません。
zh_hans: 请选择一个项目；点击生成二维码前不会上传任何内容。

# share.created
source: Temporary share created
ja: 一時共有を作成しました
zh_hans: 临时分享已创建

# share.effects
source: Effects
ja: エフェクト
zh_hans: 灯效

# share.expires
source: Expires
ja: 有効期限
zh_hans: 有效期至

# share.generate
source: Generate QR
ja: QRを生成
zh_hans: 生成二维码

# share.import
source: Import
ja: 読み込む
zh_hans: 导入

# share.import.complete
source: Local copy created
ja: ローカルコピーを作成しました
zh_hans: 本地副本已创建

# share.import.confirm
source: Create local copy
ja: ローカルコピーを作成
zh_hans: 确认创建本地副本

# share.import.duplicate
source: This token was already imported; another copy will not be created.
ja: この共有コードは読み込み済みのため、別のコピーは作りません。
zh_hans: 该分享码已导入过，不会再次创建副本。

# share.import.local-id
source: Local ID
ja: ローカル ID
zh_hans: 本地 ID

# share.import.placeholder
source: 10-character code or link
ja: 10文字のコードまたはリンク
zh_hans: 10 位分享码或链接

# share.import.preview
source: Validate and preview
ja: 検証してプレビュー
zh_hans: 校验并预览

# share.import.safe-message
source: The imported item is not played and does not connect to a device automatically.
ja: 読み込み後に自動再生やデバイスへの自動接続は行いません。
zh_hans: 导入后不会自动播放，也不会自动连接设备。

# share.import.section
source: Import a shared item
ja: 共有アイテムを読み込む
zh_hans: 导入分享内容

# share.import.validate
source: Validate and preview
ja: 検証してプレビュー
zh_hans: 校验并预览

# share.kind.blocks
source: Block effect
ja: ブロックエフェクト
zh_hans: 积木灯效

# share.kind.effect
source: Effect
ja: エフェクト
zh_hans: 灯效

# share.kind.palette
source: Custom palette
ja: カスタム応援色
zh_hans: 自定义应援色

# share.kind.script
source: Maurya Script effect
ja: Maurya Script エフェクト
zh_hans: Maurya Script 灯效

# share.network.pending
source: The token is valid. Download and transactional import remain unavailable until the server contract and staging service are approved.
ja: トークンは有効です。サーバー契約とステージング環境が承認されるまで、ダウンロードとトランザクション取り込みは利用できません。
zh_hans: 分享码有效。服务端合同与测试环境获批前，下载和事务导入仍不可用。

# share.open
source: Share
ja: 共有
zh_hans: 分享

# share.palettes
source: Custom palettes
ja: カスタム応援色
zh_hans: 自定义应援色

# share.preview
source: Validated link
ja: 検証済みリンク
zh_hans: 已校验链接

# share.preview.avatar
source: Palette avatar
ja: パレットのアバター
zh_hans: 色板头像

# share.preview.color
source: Color
ja: 色
zh_hans: 颜色

# share.preview.effect.unavailable
source: Preview unavailable
ja: プレビューできません
zh_hans: 无法预览

# share.preview.effect.unavailable.message
source: The verified effect source cannot be rendered locally.
ja: 検証済みのエフェクトソースを端末内で描画できません。
zh_hans: 已验证的效果源码无法在本地渲染。

# share.preview.kind
source: Type
ja: 種類
zh_hans: 类型

# share.preview.name
source: Name
ja: 名前
zh_hans: 名称

# share.preview.verified
source: Hash, schema, moderation, and local compilation checks passed
ja: ハッシュ、構造、審査、ローカルコンパイルの検証に成功
zh_hans: 哈希、结构、审核与本地编译校验均已通过

# share.qr.accessibility
source: Maurya temporary share QR code
ja: Maurya 一時共有 QR コード
zh_hans: Maurya 临时分享二维码

# share.qr.error.message
source: Use the displayed token or share link instead.
ja: 表示されたトークンまたは共有リンクを使用してください。
zh_hans: 请改用显示的口令或分享链接。

# share.qr.error.title
source: Couldn’t Generate QR Code
ja: QRコードを生成できません
zh_hans: 无法生成二维码

# share.qr.generating
source: Generating QR code
ja: QRコードを生成中
zh_hans: 正在生成二维码

# share.scan.button
source: Scan QR code
ja: QRコードを読み取る
zh_hans: 扫描二维码

# share.scan.hint
source: Place the Maurya QR code inside the camera view
ja: Maurya QRコードをカメラ内に合わせてください
zh_hans: 请将 Maurya 二维码放入取景框

# share.scan.permission.message
source: Allow camera access to scan a QR code, or continue by entering the share code manually.
ja: QRコードを読むにはカメラを許可してください。共有コードの手入力も引き続き利用できます。
zh_hans: 允许相机权限即可扫描二维码；也可以继续手动输入分享码。

# share.scan.permission.title
source: Camera access needed
ja: カメラへのアクセスが必要です
zh_hans: 需要相机权限

# share.scan.title
source: Scan Maurya Share
ja: Maurya 共有をスキャン
zh_hans: 扫描 Maurya 分享码

# share.scan.unavailable.message
source: Enter the 10-character share code manually.
ja: 10文字の共有コードを手動で入力してください。
zh_hans: 请手动输入 10 位分享码。

# share.scan.unavailable.title
source: Scanning unavailable
ja: スキャンを利用できません
zh_hans: 无法使用扫码

# share.section
source: Share mode
ja: 共有モード
zh_hans: 分享模式

# share.section.create
source: Create
ja: 共有を作成
zh_hans: 创建分享

# share.section.import
source: Import
ja: 共有を読み込む
zh_hans: 导入分享

# share.service.unavailable
source: The production sharing workflow is unavailable.
ja: 本番共有ワークフローは現在利用できません。
zh_hans: 生产分享工作流当前不可用。

# share.status
source: Status
ja: 状態
zh_hans: 状态

# share.system
source: Share link
ja: リンクを共有
zh_hans: 系统分享链接
